/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   algorithm.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bbear <bbear@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/29 17:12:38 by bbear             #+#    #+#             */
/*   Updated: 2019/01/10 20:34:21 by bbear            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"
#include <stdio.h>

int	ft_sqrt(int nb)
{
	int	res;

	res = 1;
	while (res * res != nb)
	{
		if (res * res >= nb)
		{
			return (res);
		}
		++res;
	}
	return (0);
}

char	solution(t_list *figures)
{
	int	mapsize;

	mapsize =
	//нужно узнать количество фигурок, создать все-таки структуру под карту, а то маллочить каждый раз слишком дорого
}